eisup_2019_docmng_integration/src/InformationRegisters/абс_ЛимитыПоФилиалам/абс_ЛимитыПоФилиалам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ЛимитыПоФилиалам</name>
  <resources>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ЛимитыПоФилиалам/ManagerModule.bsl
Функция ПревышенПорогСогласованияПоФилиалу(Сумма,Филиал) Экспорт
	
	ПределПревышен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &Сумма > абс_ЛимитыПоФилиалам.Лимит
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПределПревышен
		|ИЗ
		|	РегистрСведений.абс_ЛимитыПоФилиалам КАК абс_ЛимитыПоФилиалам
		|ГДЕ
		|	абс_ЛимитыПоФилиалам.Филиал = &Филиал";

	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("Сумма", Сумма);

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПределПревышен = ВыборкаДетальныеЗаписи.ПределПревышен;	
	КонецЕсли;

    Возврат ПределПревышен;
	
КонецФункции
